Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཀུན་ ཏུ་ སྲུང་བ འི་ བདག་པོ་ སྤྲིན་ གྱི་ དབང་ཕྱུག་ མར་མེ་ དེ འི་ ཚེ་ཚད་ ནི་ བསྐལ་པ་ ཕྱེད་ ཚང་བ ར་ ཐུབ་པ ར་ འགྱུར་ རོ །_།
en: Śāradvatī­putra, the lifespan of the thus-gone one, the worthy one, the perfect buddha Ārakṣapati Megheśvaradīpa lasted a full half eon.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཀུན་ ཏུ་ སྲུང་བ འི་ བདག་པོ་ སྤྲིན་ གྱི་ དབང་ཕྱུག་ མར་མེ་ དེ འི་ ཉན་ཐོས་ འདུས་པ་ ནི་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ བྱུང་བ ར་ གྱུར་ ཏེ
en: Śāradvatī­putra, the assembly of hearers of the thus-gone one, the worthy one, the perfect buddha Ārakṣapati Megheśvaradīpa numbered as many as there are grains of sand in the river Ganges.

source: ཉན་ཐོས་ འདུས་པ་ རེ་རེ་ ཡང་ གཉི་ག འི་ ཆ་ ལས་ རྣམ་པར་ གྲོལ་བ །_ ཤེས་རབ་ ཕུན་སུམ་ ཚོགས་པ །_ ལྟ་བ་ ཕུན་སུམ་ ཚོགས་པ །_ ལུས་ ཀྱིས་ མངོན་དུ་ བྱེད་པ་ དག་ གོ །_།
en: Each of the hearers assembled, moreover, had actualized within their physical existence emancipation from both parts,#51 excellent insight, and excellent view.

source: ཤ་ར་ དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ ཀུན་ དུ་ སྲུང་བ འི་ བདག་པོ་ སྤྲིན་ གྱི་ དབང་ཕྱུག་ མར་མེ་ དེ འི་ ཉན་ཐོས་ འདུས་པ་ དེ་དག་ ཇི་སྙེད་ བྱུང་བ་ དེ་སྙེད་ དུ །_ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ འདུས་པ་ དག་ ཀྱང་ དེ་སྙེད་ ཁོ་ན་ བྱུང་བ ར་ གྱུར་ ཏེ
en: Śāradvatī­putra, the thus-gone one Ārakṣapati Megheśvaradīpa also had an assembly of just as many bodhisattva great beings as he had hearers.

source: ཕྱིར་ མི་ ལྡོག་པ་ དག་ ཀྱང་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ བྱུང་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཐེག་པ་ ལ་ གསར་ དུ་ ཞུགས་པ་ དག་ ལྟ་ཅི་ སྨོས །_
en: Since the irreversible bodhisattvas were as many in number as there are grains of sand in the river Ganges, there is no need to mention the number of bodhisattva great beings who had newly embarked on that vehicle.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཀུན་ ཏུ་ སྲུང་བ འི་ བདག་པོ་ སྤྲིན་ གྱི་ དབང་ཕྱུག་ མར་མེ་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་ བ ར་ མཛད་པ་ ན །_
en: Śāradvatī­putra, by the time the thus-gone one, the worthy one, the perfect buddha Ārakṣapati Megheśvaradīpa passed away,

source: འཛམ་བུ འི་ གླིང་ བྱེ་བ་ ཕྲག་ བརྒྱ་ ཐམས་ཅད་ དུ་ ཆོས་ སྨྲ་བ་ བྱེ་བ་ ཕྲག་ བརྒྱ་བྱིན་ གྱིས་ བརླབས་ སོ །_།
en: he had authorized one billion Dharma preachers throughout one billion Jambudvīpas.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ སྲུང་བ འི་ བདག་པོ་ སྤྲིན་ གྱི་ དབང་ཕྱུག་ མར་མེ་ དེ འི་ དམ་པ འི་ ཆོས་ ནི་ ལོ་ བྱེ་བ་ ཁྲག་ཁྲིག་ འབུམ་ཕྲག་ བརྒྱད་ཅུ ར་ གནས་ སོ །_།
en: $1114 “Śāradvatī­putra, the sublime Dharma of the thus-gone one Ārakṣapati Megheśvaradīpa remained for eight quintillion years. [135.b]

source: [135b] ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ དུས་ ན་ སེམས་ཅན་ དེ་དག་ གི་ ཚེ འི་ ཚད་ ནི་ ལོ་ བྱེ་བ་ ཕྲག་ བརྒྱད་ཅུ་ ཐུབ་པ ར་ འགྱུར་ ཏེ །_
en: Śāradvatī­putra, during that time, the lifespan of beings was eight hundred million years and,

source: སེམས་ཅན་ གང་ཡང་ བར་མ་དོ ར་ འཆི་བ འི་ དུས་ མི་ བྱེད་ དོ །_།
en: since no one died prematurely,

source: སེམས་ཅན་ དེ་དག་ བྱ་བ་ ཐམས་ཅད་ ལ་ ཤིན་ཏུ་ མཐར་ཐུག་པ་ ཡིན་ ནོ །_།
en: everyone could fully complete all their actions.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ འཛམ་ བུ འི་ གླིང་ དེར་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ་ ཞེས་ བྱ་བ་ ཞིག་ བྱུང་ ངོ་ །_།
en: Śāradvatī­putra, a Dharma preacher called Prabhakīrti then appeared in that Jambudvīpa.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ་ དེ་ དམ་པ འི་ ཆོས་ ཇི་སྲིད་ དུ་ གནས་པ་ དེ་སྲིད་ དུ་ བྱིན་ གྱིས་ བརླབས་ སོ །_།
en: Śāradvatī­putra, the Blessed One blessed the bodhisattva Dharma preacher Prabhakīrti to remain for as long as his sublime Dharma remained.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ་ དེ་ ནི་ ཕྱིར་ མི་ ལྡོག་པ འི་ བཟོད་པ་ ཐོབ་པ ར་ གྱུར་པ འོ །_།
en: Śāradvatī­putra, Prabhakīrti attained acceptance and became irreversible.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ ཕྱི་མ འི་ ཚེ་ ཕྱི་མ འི་ དུས་ དམ་པ འི་ ཆོས་ ནུབ་པ འི་ དུས་ ཀྱི་ ཚེ་ ན་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ་ དེ་ གྲོང་ ནས་ གྲོང་ དུ །_ གྲོང་ཁྱེར་ ནས་ གྲོང་ཁྱེར་ དུ །_ ལྗོངས་ ནས་ ལྗོངས་ སུ་ འཁོར་ ནས་ |#| འཁོར་ དུ་ དེ་བཞིན་ གཤེགས་པ འི་ བྱང་ཆུབ་ བསྐལ་པ་ བྱེ་བ་ གྲངས་མེད་ པས་ ཡང་དག་ པར་ བསྒྲུབས་པ་ ཡང་དག་ པར་ རབ་ཏུ་ བསྟན་ ཏོ །_།
en: Later, Śāradvatī­putra, as the sublime Dharma was disappearing, the Dharma preacher Prabhakīrti perfectly taught the perfect accomplishment of a thus-gone one’s awakening for countless millions of eons, going from village to village, town to town, country to country, and realm to realm.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ འཛམ་བུ འི་ གླིང་ དེར་ མཐའ་འཁོབ་ ཀྱི་ གྲོང་ཁྱེར་ གྲོང་ཁྱེར་ བརྟན་ལྡན་ ཞེས་ བྱ་བ་ བྱུང་ ངོ་ །_།
en: $1115 “Śāradvatī­putra, during that time there was in that Jambudvīpa a frontier town called Dhṛtivati.

source: གྲོང་ཁྱེར་ དེར་ ཡང་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ ཞེས་ བྱ་བ་ བྱུང་ སྟེ །_
en: There was a householder in that town called Dhṛtisena.

source: ཁྱིམ་བདག་ བརྟན་ པ འི་ སྡེ་ དེ་ ནི་ གཞོན་ནུ་ དར་ལ་ བབ་པ ར་ གྱུར་པ་ སྟེ །_ |#| གྲོང་ཁྱེར་ གྱི་ བྱ་བ་ དག་བྱེད་ དོ །_།
en: The householder Dhṛtisena, being in the prime of youth, performed obligations on behalf of the town.

source: དུས་གཞན་ ཞིག་ ན་ གྲོང་ཁྱེར་ གྱི་ བྱ་བ་ ལ་ མངོན་པར་ བརྩོན་པ་ དེ་ ལ་ སེམས་སྐྱེས་པ །_
en: At some point, a thought occurred to him about his immersion in the town’s business:

source: ཤེས་པ་ གང་ཡང་ དག་པ ར་ བསྒྲུབས་ ནས་ |#| སེམས་ཅན་ དེ་དག་ ལ་ དམ་པ འི་ ཆོས་ ཡང་དག་ པར་ རབ་ཏུ་ སྟོན་ ཅིང་ །_ ཆོས་ དེ འི་ དོན་ ཡང་དག་ པར་ རབ་ཏུ་ སྟོན་ ལ །_ དེ འི་ དོན་ ཡང་དག་ པར་ རབ་ཏུ་ བསྟན་ ན་ |#| སེམས་ཅན་ དེ་དག་ བྱ་བ་ ཐམས་ཅད་ ལ་ ཤིན་ཏུ་ མཐར་ཐུག་ པར་ འགྱུར་བ འི་ ཤེས་པ་ དེ་ ཅི་འདྲ་ ཞིག་ གུ་ སྙམ་ མོ །_།
en: ‘What kind of knowledge should I gain in order to teach others the sublime Dharma such that, upon teaching them its meaning, all their activities would be fulfilled?’

source: ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ དེ་ གཅིག་པུ་ དབེན་པ ར་ སོང་ ནས་
en: $1116 “The householder Dhṛtisena then went alone to an isolated place, and

source: དེ་ སྙམ་ དུ་ སེམས་པ་ ན་ ལྷ་ ཞིག་ འོངས་ ནས་ འདི་སྐད་ ཅེས་ སྨྲས་ སོ །_།
en: while thus contemplating, a deity appeared and said,

source: ཁྱིམ་བདག་ དེ་བཞིན་ གཤེགས་པ་ ཀུན་ དུ་ སྲུང་བ འི་ བདག་པོ་ སྤྲིན་ གྱི་ དབང་ཕྱུག་ མར་མེ་ ཞེས་ བྱ་བ་ ཡོད་ དོ །_།
en: ‘Householder, there is a thus-gone one called Ārakṣapati Megheśvaradīpa.’

source: དེ་ནས་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ རངས་པ་ སྐྱེས་ སོ །_།
en: $1117 “The householder Dhṛtisena was instantly elated,

source: དེ་ནས་ ལྷ་ དེས་ ཡང་ སྨྲས་པ །_
en: whereupon the god said,

source: ཁྱིམ་བདག་ དེ་ ནི་ ཡོངས་སུ་ མྱ་ངན་ ལས་ [136a] འདས་ སོ །_།
en: ‘However, householder, he has passed away.’ [136.a]

source: དེ་ནས་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ ངུས་ སོ །_།
en: The householder Dhṛtisena then started to cry but

source: དེ་ནས་ ལྷ་ དེས་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ དེ་ ལ་ འདི་སྐད་ ཅེས་ སྨྲས་ སོ །_།
en: the deity then asked him,

source: ཁྱིམ་བདག་ ཁྱོད་ ཅིའི་ཕྱིར་ རངས་པ་ སྐྱེས་ ནས་ ཕྱིས་ ངུས །_
en: ‘Householder, why were you first elated, but now you cry?’

source: ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེས་ ལྷ་ དེ་ ལ་ སྨྲས་པ །_
en: the householder Dhṛtisena replied,

source: ལྷ་ ཁྱོད་ ཀྱིས་ དེ་བཞིན་ གཤེགས་པ་ ཡོད་ དོ་ ཞེས་ དེ་སྐད་ ཅེས་ སྨྲས་པ་ དེ་ ལ་ བདག་ རངས་པ་ སྐྱེས་ སོ །_།
en: $1118 “ ‘Well, god,’ |#| ‘I was elated because you said there was a thus-gone one, and

source: གང་དེ་ བཞིན་ གཤེགས་པ་ མེད་ དོ་ ཞེས་ དེ་སྐད་ ཅེས་ སྨྲས་པ་ དེ་ ལ་ བདག་ ངུས་ ཏེ །_
en: I’m crying because you said he has passed away.

source: ལྷ་ འདི་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ བདག་ གིས་ མ་ མཐོང་བ ས་ བདག་ འཚོ་ བ་ ནི་ དོན་མེད་ དོ །_།
en: Deity, since I have never seen a thus-gone one, my life is meaningless.’

source: དེ་ནས་ ལྷ་ དེས་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ ལ་ འདི་སྐད་ ཅེས་ སྨྲས་ སོ །_།
en: $1119 “The god then said to the householder Dhṛtisena,

source: ཁྱིམ་བདག་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཀུན་ ཏུ་ སྲུང་བ འི་ བདག་པོ་ སྤྲིན་ གྱི་ དབང་ཕྱུག་ མར་མེ་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་བ་ ན་ དགེ་སློང་ ཆོས་ སྨྲ་བ་ ཆོས་སྟོན་པ་ འོད་ གྲགས་པ་ ཞེས་ བྱ་བ་ བྱིན་ གྱིས་ བརླབས་པ་ ཡོད་ དེ
en: ‘Householder, there is a Dharma preacher monk called Prabhakīrti, who was authorized when the thus-gone one, the worthy one, the perfect buddha Ārakṣapati Megheśvaradīpa passed away.

source: ཁྱིམ་བདག་ ཆོས་ སྨྲ་བ་ དེ་ ནི་ བཅོམ་ལྡན་འདས་ དེས་ ཇི་སྙེད་ ཀྱི་ ཆོས་ བསྟན་པ་ མཛད་པ་ དེ་ ཐམས་ཅད་ ཀུན་འཛིན་ པར་ བྱེད་ ཀྱི་ ཆུད་ གཟོན་པ ར་ མི་ བྱེད་ དོ །_།
en: Householder, that preacher retains the entire Dharma taught by that blessed one, without squandering any of it!

source: ཁྱིམ་བདག་ དགེ་སློང་ དེ་ ནི་ བཅོམ་ལྡན་ འདས་ དེ འི་ ཆོས་ ཀྱི་ མཛོད་འཛིན་པ འོ །_།
en: Householder, that monk retains that thus-gone one’s treasury of Dharma.’

source: དེ་ནས་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེས་ ལྷ་ དེ་ ལ་ འདི་སྐད་ ཅེས་ སྨྲས་ སོ །_།
en: the householder Dhṛtisena asked the deity.

source: ལྷ་ཆོས་ སྨྲ་བ་ དེ་ ད་ལྟ ར་ གང་ ན་ གནས །_
en: $1120 “ ‘Where, god, does that Dharma preacher now dwell?’

source: ལྷ ས་ སྨྲས་པ །_
en: “The god replied,

source: ཁྱིམ་བདག་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ་ དེ་ ནི་ ད་ལྟ ར་ སེར་སྐྱ འི་ གྲོང་ཁྱེར་ གྱི་ རྒྱལ་པོ འི་ ཕོ་བྲང་ ན་ གནས་ ཏེ །_
en: ‘Householder, the Dharma preacher Prabhakīrti dwells in the town of Kapilavāstu, in the king’s palace.

source: རྒྱལ་པོ འི་ ཕོ་བྲང་ དེ་ ནི་ འདི་ ནས་ ཤར་ཕྱོགས་ སུ་ དཔག་ཚད་ དྲུག་ སྟོང་ སུམ་བརྒྱ་ འདས་པ་ ན་ ཡོད་ དོ །_།
en: The king’s palace is 6,300 leagues to the east of here.’

source: དེ་ནས་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེས་ དེ འི་ མཚན་མོ་ འདས་ ནས །_ |#| འགྲོན་བུ་ བྱེ་བ་ ཕྲག་ བརྒྱད་ཅུ་ ཐོགས་ ཤིང་ གསེར་སྲང་ བྱེ་བ་ ཕྲག་ བརྒྱད་ཅུ་ ཐོགས་ ནས །_ |#| གཡོག་འཁོར་ མང་པོ་ དང་ སེར་སྐྱ འི་ རྒྱལ་པོ འི་ ཕོ་བྲང་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_
en: $1121 “After spending the night there, the householder Dhṛtisena then set out for the palace of the king of Kapilavāstu, carrying eight hundred million cowrie shells and eight hundred million ounces of gold. |#| Once he arrived there,

source: ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ རྐང་པ་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ནས་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_།
en: he went to where the Dharma preacher Prabhakīrti was, bowed to his feet, and sat to one side.

source: ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་པ་ ལ་ ཡང་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པས་ འདི་ལྟ་སྟེ་ [136b] སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཐེ་ཚོམ་ གཅོད་པ ར་ བྱེད་པ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས །_ |#| སེམས་ཅན་ ཐམས་ཅད་ ཡང་དག་ པར་ ཚིམ་པ ར་ བྱེད་པ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས །_ |#| བྱང་ཆུབ་ སེམས་དཔ འི་ དགེ་བ འི་ རྩ་བ་ ཡང་དག་ པར་ སྐུལ་བ འི་ གཏམ་བཟང་པོ་ བྱས་ སོ །_།
en: Once the householder Dhṛtisena was seated, the Dharma preacher Prabhakīrti [136.b] delivered a Dharma discourse that resolves the doubts of all beings, a Dharma discourse that perfectly satisfies all beings, a fine speech that perfectly inspires roots of virtue among bodhisattvas.

source: དེ་ནས་ ཁྱིམ་བདག་ བརྟན་ པ འི་ སྡེ་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ་ ལ་ སེམས་ དད་ ནས་ ལེགས་པ ར་ གསུངས་ སོ་ ཞེས་ སྨྲས་ ཏེ་ འགྲོན་བུ་ དེ་དག་ དང་ །_ གསེར་སྲང་ དེ་དག་ ཕུལ་ ལོ །_།
en: The householder Dhṛtisena, who by now had developed devotion for the Dharma preacher Prabhakīrti, praised his speech and offered to him all the cowrie shells and gold.

source: རིམ་གྲོ་ དང་ བསྙེན་བཀུར་ བྱ་བ འི་ ཕྱིར་ བདག་ཉིད་ ཀྱང་ ཕུལ་ ལོ །_།
en: He also offered himself to serve and attend upon Prabhakīrti.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ དེ་ ལ་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ་ ལ་ རིམ་གྲོ་ དང་ བསྙེན་བཀུར་ བྱ་བ ར་ མངོན་པར་ བརྩོན་ ཞིང་ །_ ཆོས་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ མངོན་པར་ བརྩོན་པ ར་ གྱུར་ ཏེ
en: $1122 “Śāradvatī­putra, the householder Dhṛtisena was perseverant in serving and attending upon the Dharma preacher Prabhakīrti and in pursuing the Dharma,

source: འདི་ལྟ་སྟེ །_ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ དེ་ཉིད་ གཟུང་བ་ དང་ །_ ཡི་གེར་ བྲི་བ་ དང་ །_ བཀླག་པ འི་ ཕྱིར་ ལོ་ བྱེ་བ་ ཕྲག་ དྲུག་ཅུ ར་ ཕྱི་བཞིན་ དུ་ རྗེས་སུ་ འབྲངས་ སོ །_།
en: such that he attended upon him for six hundred million years in order to receive, write down, and recite that very Dharma discourse.

source: ལོ་ བྱེ་བ་ ཕྲག་ དྲུག་ཅུ་པོ་ དེར་ ཡང་ མཉན་པ འམ །_ ཡི་གེར་ བྲི་བ འམ །_ ལུང་ ནོད་པ ར་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ དེ་ |#| མ་ ཐོབ་བོ །_།
en: But for the entire six hundred million years, he never again received that Dharma discourse to listen to, write down, or expound upon.

source: དེ་ ལོ་ བྱེ་བ་ ཕྲག་ དྲུག་ཅུ ར་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ་ ལ་ རིམ་གྲོ་ བྱེད་པ་ ན །_ |#| ནམ་ དུ་ ཡང་ རྨུགས་པ་ དང་ །_ གཉིད་ ཀྱིས་ མ་ ནོན་ ཏོ །_།
en: Throughout those six hundred million years that he served the Dharma preacher Prabhakīrti he was never impeded by either sloth or sleep.

source: དེ་ ལོ་ བྱེ་བ་ ཕྲག་ དྲུག་ཅུ ར་ ཆོས་ སྨྲ་བ་ དེ་ ལ་ རིམ་གྲོ་ བྱེད་པ་ ན་ ནམ་ དུ་ ཡང་ ཆོས་ དང་ མ་ བྲལ་ ལོ །_།
en: Throughout those six hundred million years of his service to the Dharma preacher he never ever parted from the Dharma.

source: དེ་ ལོ་ བྱེ་བ་ ཕྲག་ དྲུག་ཅུ ར་ ཆོས་ སྨྲ་བ་ དེ་ ལ་ རིམ་གྲོ་ བྱེད་པ་ ན་ ནམ་ དུ་ ཡང་ འདོད་པ འི་ རྣམ་པར་ རྟོག་པ་ ལ་ རྣམ་པར་ རྟོག་པ ར་ མ་ གྱུར །_ |#| གནོད་སེམས་ ཀྱི་ རྣམ་པར་ རྟོག་པ་ ལ་མ་ ཡིན །_ |#| རྣམ་པར་ འཚེ་བ འི་ རྣམ་པར་ རྟོག་ པ་ ལ་མ་ ཡིན་ ནོ །_།
en: Throughout those six hundred million years of his service to the Dharma preacher he never had a thought of desire, ill will, or aggression toward him.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ཆོས་ སྨྲ་བ་ དེ་ གནས་ གང་ ན་ གནས་པ འི་ གནས་ དེ འི་ སྒོ ར་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ མི་ ཉལ་བ ར་ གྱུར་ ཏེ །_
en: Śāradvatī­putra, the householder Dhṛtisena would not sleep at the threshold of wherever the Dharma preacher was staying but,

source: ཀུན་ བསྲུང་བ འི་ ཕྱིར་ ལངས་པ་ ཉིད་ ཀྱིས་ འདུག་ གི་ ཉལ་བ ས་ ནི་ མ་ ཡིན་ ནོ །_།
en: in order to protect him, would stand at attention without lying down.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ དུས་ ན་ བདུད་ རྟག་ ཏུ་ གླགས་ ཚོལ་ བ་ ལ་ རྗེས་སུ་ ལྟ་བ་ ཞེས་ བྱ་བ་ ཞིག་ བྱུང་ ངོ་ །_།
en: $1123 “Śāradvatī­putra, once a māra named Sadā­vatāra­prekṣin appeared.

source: དེ་ནས་ བདུད་ རྟག་ ཏུ་ གླགས་ ཚོལ་བ་ ལ་ རྗེས་སུ་ ལྟ་བ ས་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ ལ་ གླགས་ བཙལ་བ ར་ བལྟས་ སོ །_།
en: Sadā­vatāra­prekṣin was seeking to bring the householder Dhṛtisena down.

source: དེ་ནས་ བདུད་ རྟག་ ཏུ་ གླགས་ ཚོལ་བ་ རྗེས་སུ་ ལྟ་བ ས་ དགེ་སློང་ འོད་ གྲགས་པ་ ཇི་ འདྲ་བ་ དེ་ འདྲ་བ་ ཁོ་ན འི་ དགེ་སློང་ བུད་ [137a] མེད་ དང་ ལྷན་ཅིག་ ཏུ་ ཕྲད་པ ར་ བྱེད་པ་ ཞིག་ མངོན་པར་ སྤྲུལ་ ཏོ །_།
en: Sadā­vatāra­prekṣin thus conjured up as an emanation a monk looking exactly like the monk Prabhakīrti making the acquaintance of a woman. [137.a]

source: དེ་ནས་ བདུད་ རྟག་ ཏུ་ གླགས་ ཚོལ་བ་ ལ་ རྗེས་སུ་ ལྟ་བ ས་ སྤྲུལ་པ་ དེ་ལྟ་ བུ་ མངོན་པར་ སྤྲུལ་ ནས་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ དེ་ ལ་ འདི་སྐད་ ཅེས་ སྨྲས་ སོ །_།
en: Having conjured up that emanation, Sadā­vatāra­prekṣin said to the householder Dhṛtisena,

source: ཁྱིམ་བདག་ ཁྱེད་ ཀྱི་ སྟོན་པ་ ནང་ གི་ མཁས་ པ་ གྲགས་པ་ ཤེས་རབ་ དང་ ལྡན་པ །_ ཐོས་པ་ དང་ ལྡན་པ །_ ཐོས་པ་ རྒྱ་མཚོ་ གང་ཡིན་པ་ དེ འི་ ལོག་པ ར་ རྟོག་པ་ དང་ །_ དེ འི་ སྤྱོད་ཡུལ་ མ་ཡིན་པ་ ལ་ ལྟོས །_
en: ‘Householder, look at the erroneous thinking and impropriety of that teacher of yours, the famed scholar among teachers, insightful, learned, a veritable ocean of learning!

source: ཇི་ལྟ ར་ ན་ གཞན་ ལ་ ཡོ་བྱད་ བསྙུངས་པ འི་ གཏམ་ ཡང་ བྱེད་ ལ །_ བདག་ཉིད་ ཀྱིས་ ཚུལ་ཁྲིམས་ འཆལ་པ་ ཉིད་ ཀྱང་ ཡོངས་ སུ་ འཛིན །_
en: How can he preach to others that they should observe abstinence, and yet indulge in the very perversion of discipline?

source: ཁྱིམ་བདག་ བདག་ཉིད་ ཀྱིས་ ཚངས་པ ར་ སྤྱོད་པ འོ་ ཞེས་ ཀྱང་ ཁ ས་ འཆེ་ ལ །_ མི་ ཚངས་པ ར་ སྤྱོད་པ་ ཡང་ཡང་ དག་པ ར་ བླངས་ ནས་ གནས་པ་ ལ་ ལྟོས །_
en: Look, householder, at how he, although promoting pure conduct, indulges in fornication.

source: ཁྱིམ་བདག་ ཇི་ལྟ ར་ ན་ ཟབ་མོ་ སྤྱོད་པ་ ཡང་ ཡིན་ ཞིང་ ཡོ་བྱད་ བསྙུངས་པ་ ལ་ རབ་ཏུ་ གནས་པ་ ཡང་ ཡིན་ ལ །_ བྱ་བ་ དེ་ ལྟ་ བུ་ དང་ །_ ཚུལ་ དེ་ལྟ་ བུ་ བྱེད་པ་ ཡིན་ ཏེ །_
en: Householder, how, in doing such things and behaving in such a way, could his conduct be profound and in observance of abstinence?

source: དེ་ ནི་ གནས་ མེད་ དོ་ དེ་ ནི་ མི་རིགས་ སོ །_།
en: It is impossible! |#| It is improper!

source: ཁྱིམ་བདག་ བསྟེན་ ཅིང་ བསྙེན་བཀུར་ བྱས་པ་ དེས་ཆོག་ གིས །_
en: Householder, enough with attending upon him and serving him!

source: ཁྱོད་ ཀྱིས་ དགེ་སློང་ དེ་ལྟ་ བུ་ དེ་ ཐོང་ ཤིག _།
en: Abandon such a monk!

source: ཁྱིམ་བདག་ ཁྱོད་ ནི་ ཚུལ་ཁྲིམས་ དང་ ལྡན་པ་ དང་ །_ ཆོག་ཤེས་པ་ དང་ །_ རབ་ཏུ་ དབེན་པ་ དང་ །_ དྲན་པ་ དང་ ལྡན་པ་ དང་ །_ ཤེས་རབ་ དང་ ལྡན་པ་ ཡིན་ ལ །_ འདི་
en: Householder, you have discipline, contentment, isolation, mindfulness, and insight.

source: ལྟ་བུ་ དེ་ ནི་ ཚུལ་ཁྲིམས་ འཆལ་པ་ ཡིན་ ན
en: And so, since he is someone with perverted discipline,

source: ཇི་ལྟ ར་ ན་ ཁྱོད་ དེ་ ལ་ བསྙེན་བཀུར་ བྱེད །_
en: how can you serve him?’

source: དེ་ནས་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_
en: $1124 “The householder Dhṛtisena now thought,

source: ཇི་ལྟ ར་ ཀུན་ དུ་ སྲུང་བ འི་ བདག་པོ་ སྤྲིན་ གྱི་ དབང་ཕྱུག་ མར་མེ་ དེས་ ཆོས་ སྨྲ་བ་ ཆོས་ ཀྱི་ མཛོད་འཛིན་པ་ འོད་ གྲགས་པ་ ཞེས་ བྱ་བ་ བྱིན་ གྱིས་ བརླབས་ ཏེ །_ |#| ཆོས་ ཀྱི་ གཏེར་ ཡང་ འཛིན་པ འི་ གཏམ་ དེ་ལྟ་ བུ་ ལྷ་ དེས་ བདག་ ལ་ བྱས་ ཏེ །_ |#| དེར་ སོང་ ལ་ བསྙེན་བཀུར་ བྱོས་ ཤིག་ ཅེས་ དེ་སྐད་ ཅེས་ ཀྱང་ སྨྲས་ ཤིང་ །_
en: ‘I was inspired by what the god told me about how Ārakṣapati Megheśvaradīpa had authorized a Dharma preacher called Prabhakīrti to uphold the treasury of his Dharma, telling me that I should attend upon him.

source: བདག་ གིས་ ཀྱང་ དེ་ ལ་ སྤོབས་པ་ ཐོས་ ནས་ |#| ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ་ ག་ལ་ བ་ དེར་ སོང་ སྟེ་ |#| ཕྱིན་ ནས
en: Accordingly, I went to the Dharma preacher Prabhakīrti and

source: བདག་ ལ་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པས་ བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ ཐེ་ཚོམ་ ཐམས་ཅད་ གཅོད་པ ར་ བྱེད་པ །_ སེམས་ཅན་ ཐམས་ཅད་ ཡང་དག་ པར་ ཚིམ་པ ར་ བྱེད་པ །_ ཡང་དག་ པར་ རབ་ཏུ་ བསྟན་ ཅིང་
en: he perfectly taught me the Bodhisattva Collection of teachings that resolves all doubts and perfectly satisfies all beings.

source: བདག་ གིས་ ཀྱང་ ཆོས་ འདོད་པ ས་ ཆོས་ ཀྱི་ ཕྱིར་ དབུལ་ [137b] བ་ ཕུལ་ ཏེ |#| བདག་ཉིད་ ཀྱང་ རིམ་གྲོ་ དང་ བསྙེན་བཀུར་ བྱ་བ འི་ ཕྱིར་ ཕུལ་བས་
en: Out of desire for the Dharma, I then made offerings [137.b] and also offered myself to serve and attend upon him.

source: དེ་ ནི་ བདག་ གི་ ལེགས་པ ར་ བྱས་པ་ ཡིན་ ན །_ |#| གང་ མི་ འདི ས་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ འི་ སྤྱོད་ཡུལ་ མ་ཡིན་པ འི་ ཚིག་ སྨྲས་པ་ དེ་ ནི་ བདུད་ ཀྱི་ ལས་ ཡིན་ ནོ །_།
en: If I have acted properly, then the words that this person is saying about the impropriety of the Dharma preacher Prabhakīrti are the action of Māra.

source: དེ་ ནི་ གནས་ མེད་ སྐབས་མེད་པ འི་ ཕྱིར་ ཏེ །_
en: Because otherwise such behavior would be unthinkable and out of the question.

source: གང་དེ་ བཞིན་ གཤེགས་པ ས་ བྱིན་ གྱིས་ བརླབས་པ འི་ སེམས་ཅན་ རྣམས་ ཀྱི་ སྤྱོད་ཡུལ་ དེ་དག་ ཡིན་ ནོ་ ཞེས་ བྱ་བ་ དེ་ ནི་ གནས་ མེད་ དེ །_
en: For it is impossible that someone who has been authorized by a thus-gone one would display such comportment—

source: གདོན་ མི་ ཟ་བ ར་ འདི་ ནི་ བདུད་ དམ །_ བདུད་ ཀྱི་ རིས་ ཀྱི་ ལྷ འམ །_ བདུད་ ཀྱིས་ བྱིན་ གྱིས་ བརླབས་པ འི་ མི་ ཞིག་ ཡིན་ ནོ །_།
en: there is no doubt about it, so this must be a māra, a god from the māra realm, or a person inspired by Māra.

source: ཇི་ལྟ ར་ བདག་ གིས་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ་ ལས་ ཆོས་ བསྟན་པ་ བཟུང་བ འི་ ཆོས་ བསྟན་པ་ དེ་ ལ་ ནི་ མཚན་ཉིད་ དེ་དག་ མེད་པ འི་ ཕྱིར་ ཏེ །_
en: Since the Dharma teaching that I received from the Dharma preacher Prabhakīrti showed the absence of characteristics,

source: བདག་ གིས་ ནི་ བུད་མེད་ དེ་ ལ་ རྣམ་པར་ བལྟ་བ ར་ བྱ །_ |#| བུད་མེད་ ཀྱི་ ཆོས་ ལ་ རྣམ་པར་ བལྟ་བ ར་ བྱ །_ |#| སྐྱེས་པ་ ལ་ ཡང་ རྣམ་པར་ བལྟ་བ ར་ བྱ །_ |#| སྐྱེས་ པ འི་ ཆོས་ ལ་ ཡང་ རྣམ་པར་ བལྟ་བ ར་ བྱ་ སྟེ །_
en: so should I now regard that woman and the qualities of that woman, and that man and the qualities of that man.

source: གལ་ཏེ་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ་ དེ་དེ་ བཞིན་ གཤེགས་པ ས་ བྱིན་ གྱིས་ བརླབས་པ་ ཡིན་ ལ །_ བདག་ སྤྲུལ་པ་ ཡང་དག་པ་ མ་ཡིན་པ་ དེ་ཉིད་ ཀྱི་ དབང་ གིས་ སོང་ ན་ |#| ནི་
en: If the Dharma preacher Prabhakīrti is authorized by a thus-gone one, but I fall under the sway of that improper apparition,

source: དེ་བཞིན་ གཤེགས་པ་ ལ་ བདག་ གིས་ སྐུར་པ་ བཏབ་པ ར་ འགྱུར་ ཞིང་ །_ དེ་བཞིན་ གཤེགས་པ འི་ ཆོས་ཉིད་ ལ་ ཡང་ སྐུར་པ་ བཏབ་པ ར་ འགྱུར་ ན
en: I will be denigrating the thus-gone ones and the nature of the thus-gone ones.

source: བདག་ གིས་ ནི་ བསམ་པ་ བཟང་པོ འི་ སྨོན་ལམ་ གྱི་ དབང་ དང་ །_ དེ་བཞིན་ གཤེགས་པ་ དེ འི་ བདེན་པ འི་ བྱིན་ གྱི་ རླབས་ ཀྱིས་ བདེན་པ འི་ བྱིན་ གྱིས་ བརླབས་ བྱ འོ་ སྙམ་ མོ །_
en: I will thus invoke the power of truth through the power of aspirations from my own positive intention, and the power of truth of the thus-gone ones.’

source: དེ་ནས་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེས་ དེ འི་ ཚེ །_ བདེན་ པ་ དང་ བདེན་པ འི་ ཚིག་ གང་ གིས་ ཆོས་ སྨྲ་བ་ དེ་ བཅོམ་ལྡན་འདས་ དེས་ ཆོས་ བསྟན་པ འི་ ཕྱིར་ བྱིན་ གྱིས་ བརླབས་པ་ ཡིན་ ན །_ |#| བདག་ ལ་ ཆོས་ ཡོངས་སུ་ བཙལ་བ འི་ ཕྱིར་ ལྷག་པ འི་ བསམ་པ་ ཡོད་པ འི་ བདེན་པ་ དང་ བདེན་པ འི་ ཚིག་ དེས་ བུད་མེད་ དེ་ |#| དང་ སྐྱེས་པ་ དེ་ མི་སྣང་བ ར་ གྱུར་ཅིག་ ཅེས་ བདེན་པ འི་ བྱིན་ གྱིས་ བརླབས་ བྱས་ ཏེ
en: $1125 “The householder Dhṛtisena then invoked the power of truth, saying, ‘Through the truth and the true words of my exalted intention to pursue the Dharma, if the Dharma preacher was authorized by a thus-gone one to teach the Dharma, may that man and woman vanish!’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱིམ་བདག་ དེ འི་ བདེན་པ འི་ བྱིན་ གྱི་ རླབས་ ཀྱིས་ བུད་མེད་ དེ་ དང་ སྐྱེས་པ་ དེ་ཡང་ མི་སྣང་བ ར་ གྱུར་ ཏོ །_།
en: $1126 “Śāradvatī­putra, through the householder’s true resolve the woman and man vanished.

source: བདུད་ ཀྱི་ རིས་ དེ་དག་ མི་སྣང་བ ར་ གྱུར་ ནས །_
en: Once those beings belonging to the realm of Māra had vanished,

source: དེ་ནས་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ བསམ་པ་ འདི་ ལ་ ཞུགས་ ཏེ །_
en: the householder Dhṛtisena thought,

source: གང་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པས་ [138a] བདག་ ལ་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ བསམ་པ་ ཡང་དག་ པར་ ཚིམ་པ ར་ བྱེད་པ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཉན་ དུ་མ་ སྟེར་བ་ དེ་ཡང་ བདག་ གི་ བདུད་ ཀྱི་ ལས་ ཡིན །_
en: ‘The fact that the Dharma preacher Prabhakīrti [138.a] has never again let me listen to the Dharma discourse that perfectly satisfies the wishes of all beings is my own workings of Māra.

source: དེ་ ནི་ བདུད་ ཀྱི་ བྱིན་ གྱིས་ བརླབས་པ་ ཡིན་ ཏེ །_
en: It is due to the power of Māra,

source: འདི་ལྟར་ བདག་ ཆོས་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ མངོན་པར་ བརྩོན་ ཞིང་ རྟག་པ ར་ རྒྱུན་ དུ་ དེ འི་ རྗེས་སུ་ འབྲངས་ ན །_
en: for while I have followed him constantly, intent in the pursuit of Dharma,

source: དེས་ ཀྱང་ བདག་ ལ་ བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ ཀྱི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཉན་ དུ་མ་ བཅུག་ སྟེ །_
en: he has not permitted me to listen to the Dharma discourse of the Bodhisattva Collection.

source: ཀྱེ་མ་ བདག་ གིས་ འདི་ལྟར་ བདག་ ལ་ བདུད་ ཀྱི་ ལས་ སུ་ མི་འགྱུར་བ་ དེ་ལྟ ར་ བྱ འོ་ སྙམ་ སྟེ །_
en: Alas! |#| I will now ensure that I do not fall under the sway of the workings of Māra!’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ་ ཆོས་ སྨྲ་བ་ འོད་ གྲགས་པ འི་ རྗེས་སུ་ འབྲང་བ་ ཁོ་ན ར་ བྱེད་ ཀྱི་ ཕྱིར་ མ་ ལོག་ གོ །_།
en: Śāradvatī­putra, the householder Dhṛtisena thus did not turn away, but continued to follow the Dharma preacher Prabhakīrti.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱིམ་བདག་ བརྟན་པ འི་ སྡེ འི་ ལྷག་པ འི་ བསམ་པ་ ཕུན་སུམ་ ཚོགས་པ་ ལ་ ལྟོས །_
en: $1127 “Look at the householder Dhṛtisena’s excellent, exalted motivation, Śāradvatī­putra!

source: ལོ་ བྱེ་བ་ ཕྲག་ དྲུག་ཅུ ར་ དེས་ ཆོས་ སྨྲ་བ་ དེ འི་ རྗེས་སུ་ འབྲང་ ཞིང་ དགའ་བ་ དང་ །_
en: He took delight in following the Dharma preacher for six hundred million years. |#| And

source: དད་པས་ ཀྱང་ ཡིད་ ཡོངས་ སུ་ མི་ སྐྱོ་བ ར་ ལོ་ བྱེ་བ་ ཕྲག་ དྲུག་ཅུ ར་ རྗེས་སུ་ འབྲང་ དུ་ ཟིན་ ཀྱང་
en: although he faithfully, and without any dissatisfaction,

source: ཆོས་ ཀྱི་ རྣམ་ གྲངས་ དེ་ |#| ལན་ གཅིག་ མ་གཏོགས་ པར་ ནམ་ཡང་ མ་ ཐོས་ སོ །_།
en: followed him for six hundred million years, he only heard that Dharma discourse one single time.

source: བདུད་ རྟག་ ཏུ་ གླགས་ ཚོལ་བ་ ལ་ རྗེས་སུ་ ལྟ་བ ས་ ཀུན་ ཏུ་ རྨོངས་པ འི་ གནས་ དེ་ལྟ་ བུ་ ཀུན་ ཏུ་ བསྟན་པ་ ན་ ཡང་
en: Although the māra Sadā­vatāra­prekṣin had conjured up that delusive apparition,

source: དེ འི་ སེམས་ གཞན་ དུ་མ་ གྱུར་ ཏེ །_ |#| ཆོས་ སྨྲ་བ་ དེ་ ལ་ དད་པ་ འཐོབ་པ་ ཉིད་ དུ་ ཡང་ གྱུར་ ཏོ །_།
en: he did not change his mind, but became even more truly devout toward that Dharma preacher.
